{"---": 1218, " ": 730, "page": 2052, "1": 1275, "\n": 0, "西安电子科技大学": 6785, "·": 2365, "计算机科学": 6872, "与": 2721, "技术": 4808, "学院": 4222, "软件体系结构": 7124, "课程": 7009, "组": 6513, "software": 2191, "architecture": 1637, "绪论": 6595, "大": 4157, "主讲人": 2824, "：": 7940, "鲍亮": 7740, "2": 1338, "简介": 6389, "发展": 3602, "年": 4477, "面向": 7625, "软件工程": 7145, "专业": 2737, "。": 2603, "2010": 1356, "成为": 4741, "核心": 5487, "，": 7799, "平": 4468, "均": 4030, "人数": 2946, "人": 2939, "/": 1247, "在": 3972, "20": 1350, "90": 1535, "年代": 4480, "大学": 4165, "（": 7752, "cmu": 1727, "）": 7781, "等": 6364, "高校": 7737, "开始": 4585, "软件": 7101, "体系": 3079, "结": 6558, "构": 5408, "相关": 6237, "众多": 3025, "也": 2845, "将": 4370, "的": 5935, "学习": 4216, "了": 2851, "工程": 4447, "计划": 6861, "中": 2762, "picture": 2069, "4": 1429, "8": 1521, "性质": 4712, "学": 4215, "时": 5190, "32": 1405, "+": 1139, "16": 1316, "3": 1387, "sa": 2150, "主题": 2826, "软件设计": 7169, "知识": 6258, "；": 7990, "软件架构": 7150, "2019": 1359, "一流": 2650, "线下": 6510, "线上": 6508, "基本": 4057, "信息": 3172, "19": 1326, "个": 2755, "、": 2546, "教学": 5036, "中心": 2778, "针对": 7478, "复杂": 4107, "软件系统": 7159, "高层": 7727, "结构": 6562, "组织": 6538, "单元": 3547, "之间": 2837, "相": 6228, "互": 2898, "关系": 3264, "描述": 4914, "以及": 3000, "这种": 7265, "活动": 5641, "如": 4175, "设计": 6903, "评估": 6942, "实现": 4304, "管理": 6401, "•": 2404, "风格": 7669, "和": 3807, "模式": 5556, "分析": 3380, "构建": 5427, "体系结构": 3084, "方法": 5159, "策略": 6377, "研究": 6274, "内容": 3306, "主要": 2812, "教材": 5039, "➢": 2439, "具有": 3293, "实": 4285, "具备": 3292, "能力": 6674, "正确": 5576, "目标": 6208, "数据流": 5079, "调用": 7021, "返回": 7252, "以": 2989, "数据": 5043, "为": 2788, "虚拟机": 6739, "事件": 2867, "系统": 6447, "建模": 4555, "文档": 5115, "化": 3510, "质量": 7043, "属性": 4417, "及": 3585, "可用性": 3705, "及其": 3587, "性能": 4701, "可修改性": 3691, "安全性": 4239, "可": 3667, "测试": 5665, "性": 4687, "易用性": 5226, "综合": 6606, "应用": 4524, "案例": 5500, "总结": 4716, "5": 1470, ".": 1221, "6": 1503, "7": 1513, "9": 1530, "10": 1289, "11": 1296, "12": 1301, "13": 1304, "14": 1308, "15": 1311, "获取": 6731, "演化": 5729, "准备": 3339, "工作": 4439, "介绍": 2953, "设定": 6899, "识别": 6961, "场景": 4014, "开发": 4571, "优先级": 3030, "排序": 4873, "行动计划": 6757, "制定": 3451, "选择": 7343, "需求": 7586, "理解": 5850, "项目": 7633, "约束": 6494, "考虑": 6646, "扩展性": 4802, "灵活性": 5753, "做出": 3204, "最终": 5298, "决策": 3330, "确定": 6296, "---  ": 1220, "  page": 933, "page  ": 2053, "  1": 742, "1  ": 1277, "  ---": 738, "--- \n": 1219, "\n 西安电子科技大学": 610, "西安电子科技大学 ·": 6787, "·  ": 2366, "  计算机科学": 1057, "计算机科学 与": 6873, "与 技术": 2728, "技术 学院": 4811, "学院 ·": 4224, "  软件体系结构": 1063, "软件体系结构 课程": 7143, "课程 组": 7011, "组 \n": 6514, "\n 软件体系结构": 654, "软件体系结构 \n": 7125, "\n software": 131, "software  ": 2193, "  architecture": 822, "architecture \n": 1638, "\n 绪论": 587, "大 \n": 4158, "\n 主讲人": 176, "主讲人 ：": 2825, "：  ": 7942, "  鲍亮": 1068, "鲍亮 \n": 7741, "\n ---": 6, "  2": 756, "2  ": 1340, "西安电子科技大学  ": 6786, "  ·": 1016, "学院  ": 4223, "\n 课程": 638, "简介 \n": 6390, "\n 2": 25, "2 \n": 1339, "。 \n": 2604, "\n 2010": 27, "平 \n": 4469, "\n 在": 297, "20  ": 1352, "软件 体系": 7105, "体系 结": 3083, "结 \n": 6559, "\n 构": 471, "的 学习": 6016, "了 软件": 2861, "软件 \n": 7102, "\n 工程": 347, "中 。": 2765, "\n picture": 116, "picture  ": 2070, "  4": 782, "4 \n": 1430, "  8": 805, "8 \n": 1522, "课程 \n": 7010, "   ": 731, "16 \n": 1317, "\n 面向": 711, "\n sa": 128, "； \n": 7991, "（ 线下": 7778, "线下 ）": 6511, "线上 ）": 6509, "  3": 771, "3  ": 1389, "\n 3": 37, "3 \n": 1388, "\n 基本": 304, "信息 \n": 3173, "\n 19": 21, "中心 \n": 2779, "\n 针对": 688, "软件系统 的": 7165, "的 高层": 6188, "\n 结构": 583, "结构 、": 6564, "单元 之间": 3551, "之间 的": 2841, "相 \n": 6229, "\n 互": 182, "关系 的": 3267, "的 描述": 6054, "， 以及": 7820, "\n 这种": 666, "活动 \n": 5642, "\n ，": 729, "， 如": 7854, "设计 、": 6907, "、 评估": 2590, "评估 、": 6945, "、 实现": 2567, "、 \n": 2547, "\n 管理": 568, "等 。": 6366, "主题 \n": 2827, "\n •": 150, "•  ": 2406, "软件体系结构 的": 7139, "软件体系结构 风格": 7144, "风格 和": 7681, "和 模式": 3856, "模式 \n": 5557, "  设计": 1059, "、 分析": 2556, "分析 、": 3382, "评估 和": 6947, "\n 体系结构": 208, "方法 和": 5164, "和 策略": 3870, "策略 \n": 6378, "研究 的": 6277, "内容 \n": 3307, "\n 主要": 174, "主要 \n": 2813, "教材 \n": 5040, "\n ➢": 159, "➢ 具有": 2461, "实 \n": 4286, "的 体系结构": 5963, "知识 \n": 6259, "工程 \n": 4448, "能力 \n": 6675, "正确 的": 5578, "\n 教学": 428, "\n 目标": 541, "目标 \n": 6209, "4  ": 1431, "\n 4": 48, "绪论 \n": 6596, "风格 \n": 7670, "\n 数据流": 433, "数据流 体系结构": 5084, "体系结构 风格": 3108, "\n 调用": 640, "调用 /": 7023, "/ 返回": 1271, "返回 体系结构": 7254, "\n 以": 195, "以 数据": 2995, "数据 为": 5048, "为 中心": 2793, "中心 体系结构": 2780, "\n 虚拟机": 605, "虚拟机 体系结构": 6741, "\n 事件": 180, "事件 系统": 2882, "系统 体系结构": 6455, "软件体系结构 建模": 7135, "和 文档": 3850, "文档 化": 5117, "化 \n": 3511, "\n 质量": 644, "质量 属性": 7049, "属性 策略": 4427, "\n 可用性": 274, "及其 策略": 3589, "\n 性能": 383, "性能 及其": 4705, "\n 可修改性": 273, "可修改性 及其": 3694, "\n 安全性": 329, "安全性 及其": 4242, "\n 可": 271, "可 测试": 3674, "测试 性": 5672, "性 及其": 4692, "\n 易用性": 448, "易用性 及其": 5228, "软件体系结构 评估": 7142, "评估 \n": 6943, "综合 应用": 6607, "应用 案例": 4529, "案例 \n": 5501, "\n 总结": 385, "  5": 794, "5  ": 1472, "\n 5": 59, "5 \n": 1471, "\n 1": 10, "1 .": 1278, ".  ": 1223, "2 .": 1342, "3 .": 1391, "4 .": 1434, "5 .": 1474, "  虚拟机": 1056, "\n 6": 67, "6 .": 1507, "\n 7": 68, "7 .": 1517, "\n 8": 69, "8 .": 1525, "  可用性": 1028, "\n 9": 71, "  性能": 1037, "\n 10": 11, "  可修改性": 1027, "\n 11": 13, "  安全性": 1033, "\n 12": 14, "\n 13": 15, "\n 14": 16, "\n 15": 17, "\n 16": 18, "  6": 803, "6  ": 1505, "6 \n": 1504, "属性 \n": 4418, "获取 \n": 6732, "体系结构 \n": 3085, "\n 演化": 512, "演化 \n": 5730, "\n 评估": 628, "\n 准备": 234, "工作 \n": 4440, "\n 介绍": 190, "介绍 和": 2956, "和 目标": 3866, "目标 设定": 6215, "设定 \n": 6900, "\n 识别": 630, "识别 质量": 6966, "\n 场景": 298, "场景 开发": 4022, "开发 \n": 4572, "\n 优先级": 199, "优先级 排序": 3033, "排序 \n": 4874, "\n 行动计划": 608, "行动计划 制定": 6758, "制定 \n": 3452, "总结 和": 4718, "体系结构 的": 3104, "的 风格": 6186, "\n 选择": 674, "选择 与": 7346, "与 设计": 2733, "设计 \n": 6904, "针对 质量": 7479, "属性 的": 4426, "的 \n": 5936, "体系结构 设计": 3105, "\n 需求": 707, "需求 分析": 7591, "分析 和": 3386, "和 理解": 3864, "理解 \n": 5851, "评估 项目": 6956, "项目 约束": 7639, "约束 \n": 6495, "\n 考虑": 595, "考虑 扩展性": 6649, "扩展性 和": 4804, "和 灵活性": 3861, "灵活性 \n": 5754, "决策 \n": 3331, "确定 质量": 6303, "权衡": 5384, "冲突": 3322, "解决": 6840, "原型": 3571, "迭代": 7315, "优化": 3037, "范围": 6722, "收集": 4994, "组建": 6529, "团队": 3937, "标准": 5475, "审查": 4322, "风险": 7696, "提出": 4939, "建议": 4566, "编写": 6611, "驱动": 7707, "变更": 3647, "因素": 3933, "定义": 4266, "方案": 5155, "影响": 4636, "实施": 4297, "验证": 7710, "传递": 3064, "比较": 5610, "当前": 4623, "过程": 7219, "让": 6887, "我们": 4754, "有": 5304, "一个": 2629, "“": 2379, "最初": 5294, "”": 2393, "满足": 5725, "特定": 5785, "要求": 6790, "规模": 6816, "利用": 3427, "现有": 5840, "工具": 4444, "加速": 3488, "定制": 4282, "准确": 3342, "《": 2621, "》": 2623, "主讲": 2822, "教师": 5037, "副教授": 3459, "王璐": 5820, "经验": 6554, "&": 1079, "丰富": 2784, "研发": 6273, "✓": 2426, ":": 1536, "on": 2025, "an": 1620, ",": 1144, "mary": 1978, "shaw": 2171, "david": 1776, "garlan": 1866, "-": 1149, "1996": 1334, "第": 6351, "版": 5771, "辅助": 7178, "in": 1893, "second": 2158, "by": 1693, "clements": 1725, "kazman": 1939, "addison": 1596, "wesley": 2325, "the": 2255, "of": 2020, "design": 1783, "and": 1624, "t": 2248, "理论": 5855, "实践": 4319, "工业": 4437, "参考": 3583, "—": 2373, "如何": 4179, "？": 7997, "互动": 2900, "自主": 6694, "检测": 5508, "多维": 4154, "考核": 6644, "效果": 5023, "反馈": 3596, "机制": 5373, "评价": 6941, "应": 4519, "用": 5875, "提升": 4943, "学生": 4221, "实际": 4321, "改进": 5000, "课堂": 7008, "引导": 4608, "式": 4603, "讨论": 6884, "任务": 3017, "导向": 4365, "体验": 3110, "探究": 4879, "基于": 4043, "做": 3203, "！": 7750, "该": 6978, "26": 1375, "同": 3758, "\n 设计": 625, "设计 体系结构": 6912, "\n 权衡": 468, "权衡 和": 5386, "和 冲突": 3818, "冲突 解决": 3324, "解决 \n": 6841, "\n 原型": 262, "原型 和": 3572, "和 评估": 3876, "\n 迭代": 670, "迭代 优化": 7317, "\n 确定": 553, "确定 评估": 6302, "范围 \n": 6723, "\n 收集": 423, "收集 相关": 4996, "\n 组建": 579, "组建 评估": 6530, "评估 团队": 6948, "团队 \n": 3938, "标准 \n": 5476, "体系结构 审查": 3093, "审查 \n": 4323, "属性 评估": 4430, "\n 风险": 718, "风险 识别": 7704, "识别 和": 6964, "和 分析": 3820, "分析 \n": 3381, "\n 提出": 415, "文档 \n": 5116, "识别 驱动": 6967, "驱动 变更": 7709, "因素 \n": 3934, "\n 定义": 332, "定义 演化": 4274, "演化 目标": 5737, "设计 演化": 6921, "演化 方案": 5735, "方案 \n": 5156, "评估 演化": 6953, "演化 影响": 5734, "影响 \n": 4637, "\n 实施": 336, "实施 演化": 4298, "演化 计划": 5740, "计划 \n": 6862, "\n 测试": 504, "测试 和": 5670, "和 验证": 3894, "验证 \n": 7711, "\n 文档": 439, "化 和": 3512, "和 知识": 3867, "知识 传递": 6260, "传递 \n": 3065, "\n 分析": 238, "和 比较": 3857, "比较 风格": 5612, "评估 当前": 6950, "当前 的": 4626, "的 构建": 6076, "构建 过程": 5430, "过程 \n": 7220, "” 的": 2401, "  7": 804, "7  ": 1515, "7 \n": 1514, "\n 构建": 473, "要求 的": 6793, "软件系统 \n": 7160, "\n 利用": 242, "开发 过程": 4581, "\n 为": 172, "\n 理解": 523, "定义 \n": 4267, "8  ": 1523, "《 软件体系结构": 2622, "软件体系结构 》": 7128, "\n 主讲": 175, "主讲 教师": 2823, "教师 \n": 5038, "  副教授": 1026, "副教授 \n": 3460, "\n 鲍亮": 724, "  &": 732, "&  ": 1080, "软件 项目": 7121, "  9": 806, "9  ": 1532, "9 \n": 1531, "➢ 主要": 2453, "\n ✓": 158, ":  ": 1538, "  on": 926, "on  ": 2026, "  an": 816, "an  ": 1621, ",  ": 1146, "mary  ": 1979, "  shaw": 960, "shaw ,": 2172, ", \n": 1145, "david  ": 1777, "  garlan": 884, "garlan ,": 1867, "第 1": 6353, "） \n": 7782, "architecture  ": 1639, "  in": 888, "in  ": 1894, "  second": 956, "second  ": 2159, "  by": 837, "by  ": 1694, "  kazman": 901, "  .": 739, "✓ the": 2430, "the  ": 2257, "  of": 925, "of  ": 2022, "  software": 968, "  design": 859, "design  ": 1784, "  and": 818, "and  ": 1626, ". \n": 1222, "实践 ，": 4320, "  10": 743, "10  ": 1291, "— —": 2376, "如何 “": 4180, "” ，": 2403, "， 如何": 7855, "？ \n": 7998, "1 \n": 1276, "\n 学习": 324, "学习 系统": 4219, "检测 \n": 5509, "学习 数据": 4218, "多维 考核": 4155, "考核 \n": 6645, "反馈 \n": 3597, "机制 \n": 5374, "组织 \n": 6539, "\n 考核": 594, "方法 \n": 5160, "和 工程": 3836, "应 \n": 4520, "\n 用": 528, "改进 \n": 5001, "项目 实践": 7636, "驱动 \n": 7708, "体验 探究": 3112, "基于 学习": 4050, "数据 的": 5058, "的 过程": 6166, "的 软件": 6158, "！ \n": 7751, "  11": 744, "11  ": 1298, "11 \n": 1297, "➢ 在": 2471, "在 该": 3999, "） 的": 7794, "中 ，": 2774, "原则": 3567, "同时": 3763, "通过": 7379, "运用": 7237, "主动": 2806, "思考": 4681, "架构": 5435, "完成": 4254, "架构设计": 5454, "全": 3223, "生命周期": 5864, "角色": 6837, "搭建": 4960, "桥梁": 5506, "同学": 3761, "们": 3003, "随着": 7555, "进行": 7276, "项目组": 7640, "单位": 3543, "完": 4249, "成": 4740, "方式": 5149, "多": 4131, "阶段": 7528, "知识点": 6266, "自测": 6704, "章节": 6341, "测验": 5682, "对应": 4351, "之后": 2832, "题": 7662, "实时": 4299, "参与度": 3581, "在线": 4009, "视频": 6834, "长": 7492, "期末": 5354, "形式": 4628, "给出": 6585, "30%": 1400, "核": 5485, "知": 6256, "识": 6959, "使用": 3130, "=": 1548, "*": 1138, "5%": 1477, "据": 4868, "进度": 7271, "难度": 7565, "从": 2962, "代码": 2979, "软件开发": 7147, "并": 4482, "报告": 4824, "现场": 5836, "发现": 3616, "沟": 5622, "通": 7355, "合作": 3749, "语言": 6991, "评": 6939, "评审会": 6958, "平台": 4470, "活": 5639, "统计": 6592, "计算": 6863, "得出": 4652, "–": 2368, "擅长": 4965, "而": 6653, "非": 7614, "表达": 6770, "自己": 6700, "理念": 5849, "每个": 5602, "新": 5126, "问题": 7501, "知识库": 6264, "寻找": 4364, "类似": 6426, "成功": 4742, "借鉴": 3193, "避免": 7403, "不要": 2719, "全新": 3227, "高度": 7731, "要": 6788, "采用": 7449, "精确": 6442, "对": 4337, "架构师": 5452, "…": 2407, "什么": 2948, "是": 5234, "17": 1319, "圣": 3970, "玛利亚": 5821, "百花": 5933, "教堂": 5034, "原则 和": 3569, "和 方法": 3851, "方法 。": 5162, "。 同时": 2609, "同时 \n": 3764, "， 通过": 7933, "\n 思考": 381, "方案 ，": 5158, "系统 架构设计": 6472, "架构设计 \n": 5455, "\n 、": 160, "和 实现": 3834, "实现 。": 4306, "在 软件": 4001, "生命周期 的": 5869, "\n 任务": 197, "进行 ，": 7297, "， \n": 7800, "完 \n": 4250, "\n 成": 388, "\n 案例": 484, "\n 体验": 209, "\n 知识": 546, "  12": 745, "12  ": 1303, "12 \n": 1302, "方式 \n": 5150, "： 基于": 7956, "学习 \n": 4217, "\n 数据": 430, "数据 \n": 5044, "\n 基于": 303, "数据 ，": 5063, "， 在": 7850, "之后 ，": 2834, "\n 题": 716, "\n 课堂": 637, "）  ": 7783, "  数据": 1041, "\n 。": 161, "， 以": 7819, "\n 核": 481, "标准 ，": 5478, "， 主要": 7813, "的 定义": 6020, "风格 、": 7672, "、 设计": 2589, "设计 和": 6915, "知 \n": 6257, "\n 识": 629, "和 使用": 3816, "单元 *": 3549, "\n 项目": 713, "\n 据": 405, "复杂 的": 4110, "的 软件系统": 6162, "需求 \n": 7587, "， 完成": 7858, "架构设计 、": 5456, "、 架构": 2580, "架构 \n": 5436, "、 代码": 2552, "实现 和": 4309, "和 测试": 3858, "测试 的": 5674, "的 软件开发": 6160, "\n 并": 353, "的 方式": 6066, "方式 进行": 5154, "沟 \n": 5623, "\n 通": 675, "\n 讨论": 623, "案例 分析": 5503, "评 \n": 6940, "架构 评估": 5447, "讨论 和": 6886, "和 \n": 3808, "中 的": 2772, "活 \n": 5640, "单元 \n": 3548, "  13": 746, "13  ": 1306, "13 \n": 1305, "\n –": 147, "–  ": 2370, "自己 的": 6702, "的 设计": 6150, "问题 ，": 7509, "问题 \n": 7502, "全新 的": 3228, "的 “": 5938, "” \n": 2394, "问题 的": 7508, "的 能力": 6135, "软件 的": 7114, "的 质量": 6155, "相关 \n": 6238, "对 质量": 4348, "的 要求": 6144, "要求 \n": 6791, "  14": 747, "14  ": 1310, "14 \n": 1309, "开始 \n": 4586, "（ software": 7769, "… …": 2409, "… \n": 2408, "  15": 748, "15  ": 1313, "  16": 749, "16  ": 1318, "\n 什么": 189, "什么 是": 2950, "是 \n": 5235, "\n architecture": 80, "  17": 750, "17  ": 1321, "\n 17": 19, "17 \n": 1320, "圣 ·": 3971, "· 玛利亚": 2367, "玛利亚 百花": 5822, "百花 大": 5934, "大 教堂": 4159, "教堂 \n": 5035, "瑞典": 5857, "瓦萨": 5858, "战舰": 4772, "18": 1322, "一": 2627, "无": 5170, "之": 2829, "使": 3125, "任何": 3014, "都": 7431, "好": 4174, "后": 3770, "圆顶": 3969, "部分": 7413, "50": 1479, "无法": 5176, "直到": 6220, "建筑": 4561, "仍": 2958, "未": 5357, "why": 2332, "没有": 5627, "现代": 5835, "最": 5291, "巨大": 4450, "少": 4391, "怎么": 4675, "把": 4818, "放置": 5011, "高": 7721, "没": 5626, "提供": 4932, "其中": 3283, "设备": 6898, "设计方案": 6928, "当时": 4627, "面对": 7631, "这": 7260, "类": 6421, "设计师": 6927, "安全": 4235, "建造": 4568, "300": 1401, "板": 5407, "64": 1512, "结束": 6561, "期间": 5355, "炮舰": 5759, "消息": 5688, "骨架": 7720, "已经": 4455, "又": 3584, "决定": 3327, "修": 3180, "建": 4553, "号": 3736, "增加": 4065, "它": 4226, "使得": 3128, "拥有": 4837, "达到": 7198, "备": 4101, "程度": 6331, "很": 4648, "快": 4668, "虽然": 6742, "但": 3067, "重": 7458, "存在": 4211, "缺陷": 6629, "基础": 4059, "上": 2671, "执": 4787, "行": 6744, "功能性": 3478, "非功": 7618, "能性": 6685, "可靠性": 3734, "面": 7622, "相互": 6230, "约束条件": 6498, "错误": 7486, "一些": 2642, "不": 2690, "可能": 3717, "动机": 3501, "总体": 4714, "系统结构": 6489, "算法": 6395, "数据结构": 5092, "功能模块": 3481, "变化": 3637, "频繁": 7661, "大规模": 4166, "21": 1360, "本": 5362, "节": 6717, "发展史": 3606, "作用": 3119, "22": 1363, "~": 2364, "60": 1511, "2000": 1353, "高级": 7738, "编译器": 6619, "出现": 3354, "c": 1695, "诞生": 6975, "集成": 7575, "环境": 5826, "程序": 6328, "证": 6937, "形式化": 4631, "服务": 5327, "构件": 5411, "corba": 1759, "智能化": 5273, "自动": 6695, "生成": 5870, "库": 4512, "挖掘": 4864, "协作": 3529, "工业化": 4438, "个人": 2760, "小组": 4389, "企业": 3024, "面向对象": 7629, "java": 1935, "uml": 2296, ";": 1541, "互联网": 2902, "云": 2894, "移动": 6322, "流行": 5661, "子程序": 4200, "连接": 7299, "对象": 4354, "战舰 \n": 4773, "  18": 751, "18  ": 1324, "\n 18": 20, "18 \n": 1323, "年 ，": 4479, "与 \n": 2722, "后 ，": 3773, "的 建筑": 6033, "完成 。": 4256, "， 该": 7918, "提供 的": 4937, "\n 的": 536, "的 设计方案": 6151, "的 经验": 6124, "体系 \n": 3080, "结构 ，": 6573, "\n 建筑": 364, "建筑 体系结构": 4562, "  19": 752, "19  ": 1328, "19 \n": 1327, "\n 板": 470, "的 消息": 6090, "消息 ，": 5697, "修 \n": 3181, "\n 建": 363, "， 把": 7877, "\n 它": 326, "， 使得": 7823, "了 \n": 2852, "\n 备": 310, "， 但": 7821, "经验 的": 6555, "的 基础": 6010, "基础 上": 4061, "上 ，": 2676, "执 \n": 4788, "\n 行": 606, "需求 ，": 7601, "非功 \n": 7619, "\n 能性": 601, "（ 如": 7775, "、 可靠性": 2562, "可靠性 、": 3735, "等 ）": 6371, "） 。": 7787, "\n 对": 340, "冲突 的": 3323, "约束条件 ，": 6499, "的 权衡": 6073, "权衡 \n": 5385, "， 对": 7860, "实现 的": 4313, "  20": 757, "\n 20": 26, "20 \n": 1351, "动机 \n": 3502, "\n 总体": 384, "数据结构 的": 5095, "的 选择": 6170, "\n 功能性": 248, "/ \n": 1248, "\n 非": 709, "非 功能性": 7616, "功能性 \n": 3479, "高 \n": 7722, "复杂 、": 4108, "\n 变化": 269, "  21": 762, "21  ": 1362, "\n 21": 28, "21 \n": 1361, "\n 本": 463, "本 节": 5364, "节 内容": 6718, "的 发展史": 5987, "发展史 \n": 3607, "软件体系结构 定义": 7134, "的 作用": 5964, "作用 \n": 3120, "的 研究": 6109, "研究 活动": 6276, "  22": 763, "22  ": 1365, "\n 22": 29, "22 \n": 1364, "年代 \n": 4481, "\n 高级": 723, "高级 语言": 7739, "语言 \n": 6992, "出现 ；": 3358, "语言 诞生": 6993, "诞生 ；": 6977, "诞生 \n": 6976, "\n 集成": 705, "集成 开发": 7576, "开发 环境": 4578, "面向 过程": 7628, "\n 证": 627, "方法 出现": 5163, "出现 \n": 3355, "面向 服务": 7627, "服务 开发": 5335, "\n 软件": 652, "软件 构件": 7112, "\n 智能化": 453, "软件开发 \n": 7148, "\n 程序": 560, "\n 协作": 258, "\n 开发": 365, "开发 模式": 4577, "小组 \n": 4390, "\n 面向对象": 712, "; \n": 1542, "软件 质量": 7117, "） ;": 7784, "\n 云": 181, "移动 服务": 6324, "云 计算": 2897, "\n 系统": 574, "= \n": 1549, "\n 子程序": 321, "  +": 736, "+  ": 1141, "子程序 \n": 4201, "\n 构件": 472, "连接 \n": 7300, "\n 对象": 342, "对象 \n": 4355, "\n 服务": 459, "23": 1366, "完善": 4252, "普及": 5267, "概念": 5515, "形成": 4632, "24": 1369, "1968": 1329, "北大西洋公约组织": 3515, "(": 1084, "nato": 2002, ")": 1125, "会议": 3052, "第一次": 6360, "词语": 6970, "和理": 3895, "论": 6894, "25": 1372, "逐渐": 7352, "明确": 5220, "重用": 7467, "方向": 5143, "领域": 7651, "1999": 1336, "召开": 3665, "描述语言": 4928, "提": 4929, "出": 3348, "支持": 4980, "广泛": 4506, "模型": 5551, "共享": 3239, "软件产品": 7122, "线": 6505, "被": 6772, "大量": 4167, "大型": 4163, "关注": 3256, "ieee": 1887, "发布": 3608, "标准化": 5479, "规范": 6819, "27": 1378, "28": 1381, "草图": 6728, "集合": 7572, "组成": 6531, "派": 5646, "于": 2892, "交互": 2906, "哪些": 3909, "强调": 4616, "整体": 5104, "配置": 7440, "  数据结构": 1042, "数据结构 \n": 5093, "  23": 764, "23  ": 1368, "\n 23": 30, "23 \n": 1367, "\n 理论": 524, "理论 完善": 5856, "普及 应用": 5268, "应用 \n": 4525, "\n “": 149, "\n 概念": 487, "形成 \n": 4633, "\n 算法": 567, "  24": 765, "24  ": 1371, "\n 24": 31, "24 \n": 1370, "\n 1968": 22, "1968 北大西洋公约组织": 1330, "北大西洋公约组织 (": 3516, "( nato": 1109, "nato )": 2003, ") 会议": 1135, "会议 上": 3053, "上 第一次": 2674, "第一次 出现": 6361, "出现 词语": 3357, "词语 \n": 6971, "“ software": 2380, "architecture （": 1641, "（ 软件体系结构": 7779, "软件体系结构 /": 7127, "/ 软件架构": 1270, "软件架构 ）": 7156, "） ”": 7785, "体系结构 出现": 3091, "\n （": 728, "（ 1968": 7755, "1968 ）": 1331, "概念 体系": 5519, "体系 和理": 3081, "和理 \n": 3896, "\n 论": 624, "论 体系": 6895, "体系 形成": 3082, "完善 和": 4253, "\n 普及": 451, "  25": 766, "25  ": 1374, "\n 25": 32, "25 \n": 1373, "； 相关": 7996, "描述 方法": 4923, "方法 、": 5161, "、 演化": 2583, "软件工程 领域": 7146, "领域 的": 7657, "  26": 767, "26  ": 1377, "\n 26": 33, "26 \n": 1376, "\n 1999": 24, "1999 年": 1337, "提 \n": 4930, "\n 出": 235, "， 支持": 7883, "广泛 的": 4507, "的 架构": 6077, "架构 模型": 5444, "软件产品 线": 7123, "提出 ，": 4942, "了 大量": 2859, "ieee  ": 1888, "， 为": 7812, "\n 应用": 358, "  27": 768, "27  ": 1380, "\n 27": 34, "27 \n": 1379, "  28": 769, "28  ": 1383, "设计 决策": 6913, "组成 派": 6534, "派 \n": 5647, "\n 决策": 232, "决策 派": 3335, "， 将": 7865, "将 软件体系结构": 4383, "构件 和": 5416, "和 交互": 3812, "交互 的": 2912, "的 集合": 6180, "集合 。": 7573, "\n 有": 456, "有 哪些": 5307, "组成 ，": 6535, "， 强调": 7871, "整体 结构": 5108, "结构 和": 6566, "和 配置": 3889, "实体": 4287, "视为": 6821, "一系列": 2655, "重要": 7470, "人员": 2942, "注重": 5638, "29": 1384, "1992": 1332, "d": 1769, "e": 1799, "perry": 2063, "a": 1585, "l": 1952, "wolf": 2337, "认为": 6882, "一定": 2643, "结构化": 6574, "元素": 3213, "这一": 7262, "大多数": 4164, "继承": 6593, "【": 2624, "】": 2626, "set": 2167, "architectural": 1635, "or": 2030, "elements": 1813, "that": 2253, "particular": 2057, "form": 1851, "between": 1686, "processing": 2099, "data": 1771, "this": 2264, "taxonomy": 2249, "large": 1953, "through": 2267, "other": 2041, "指": 4846, "元": 3210, "包括": 3507, "处理": 4080, "数": 5041, "负责": 7033, "加工": 3487, "不同": 2704, "组合": 6526, "连接起来": 7312, "30": 1397, "1993": 1333, "m": 1970, "component": 1737, "connector": 1748, "constraint": 1752, "...": 1245, "structures": 2228, "computation": 1743, "system": 2241, "as": 1652, "new": 2004, "problem": 2091, "structural": 2226, "organization": 2037, "control": 1757, "for": 1848, "to": 2272, "composition": 1742, "performance": 2062, "层次": 4407, "计": 6858, "算": 6394, "组件": 6515, "可以": 3677, "一组": 2658, "代": 2975, "码": 6271, "独立": 5808, "连接件": 7305, "用于": 5877, "表示": 6767, "间": 7511, "管道": 6414, "件": 3008, "31": 1402, "软件架构 中": 7151, "的 实体": 6022, "） ，": 7797, "一系列 重要": 2657, "决策 的": 3336, "\n 人员": 188, "和 决策": 3819, "架构 风格": 5449, "选择 \n": 7344, "  29": 770, "29  ": 1386, "d  ": 1770, "  e": 865, "e .": 1800, "a  ": 1587, "进行 了": 7278, "软件体系结构 是": 7137, "\n 具有": 230, "一定 形式": 2644, "形式 的": 4630, "的 结构化": 6126, "\n 【": 162, "perry  ": 2064, "  wolf": 1012, "  1992": 753, "  set": 958, "set  ": 2168, "  architectural": 821, "\n (": 2, ")  ": 1127, "  elements": 869, "elements  ": 1814, "  that": 986, "that  ": 2254, "  a": 809, "a \n": 1586, "particular  ": 2058, "  form": 881, "between  ": 1687, "  processing": 944, "processing  ": 2100, "elements ,": 1815, "  data": 856, "data  ": 1773, "and \n": 1625, "  this": 990, "this  ": 2265, "taxonomy  ": 2250, "large  ": 1954, "  through": 991, "  other": 931, "other  ": 2042, "元素 （": 3216, "elements ）": 1816, "） 是": 7792, "是 指": 5247, "） 、": 7786, "数 \n": 5042, "（ data": 7766, "） 和": 7790, "和 连接": 3884, "元素 \n": 3214, "✓ 处理": 2434, "负责 对": 7036, "对 数据": 4344, "数据 进行": 5061, "的 信息": 5967, "的 不同": 5945, "定义 -": 4269, "- 组成": 1206, "派 定义": 5648, "  30": 772, "30  ": 1399, "  m": 910, "m  ": 1971, "包括 \n": 3508, "\n component": 87, "  1993": 754, "  the": 987, "\n data": 89, "  structures": 980, "  computation": 851, ";  ": 1543, "\n the": 133, "  system": 983, "system  ": 2242, "  as": 827, "as  ": 1653, "  new": 920, "new  ": 2005, "of \n": 2021, "  structural": 979, "structural  ": 2227, "organization  ": 2038, "  control": 852, "control  ": 1758, "  for": 880, "for  ": 1850, "  to": 994, "to  ": 2274, "  performance": 936, "\n and": 78, "➢ 软件设计": 2531, "过程 中": 7223, "的 一个": 5941, "计 \n": 6859, "的 算法": 6117, "设计 。": 6908, "组件 （": 6524, "可以 是": 3683, "是 一组": 5241, "代 \n": 2976, "\n 码": 549, "， 也": 7814, "也 可以": 2847, "是 独立": 5251, "独立 的": 5817, "的 程序": 6112, "➢ 连接件": 2537, "之 \n": 2830, "\n 间": 694, "间 的": 7513, "的 相互": 6106, "相互 关系": 6231, "关系 ，": 3268, "， 可以": 7842, "过程 调用": 7230, "、 管道": 2586, "\n 和": 287, "➢ 约束": 2515, "） 为": 7789, "时 的": 5194, "\n 件": 196, "  31": 773, "31  ": 1404, "2011": 1357, "iso": 1926, "iec": 1885, "某": 5460, "其": 3278, "联系": 6665, "指导": 4851, "内": 3299, "容": 4329, "原理": 3574, "abstract": 1592, "42010": 1447, "analysis": 1622, "architectures": 1643, "systems": 2246, "use": 2303, "description": 1781, "is": 1922, "are": 1644, "specified": 2206, "common": 1734, "key": 1942, "booch": 1688, "另": 3657, "角度": 6836, "important": 1892, "decisions": 1779, "about": 1590, "their": 2258, "which": 2328, "with": 2335, "these": 2260, "into": 1916, "style": 2229, "iso /": 1927, "/ iec": 1264, "iec /": 1886, "/ ieee": 1265, "软件架构 是": 7152, "系统 的": 6475, "的 基本": 6009, "组织 结构": 6540, "\n 其": 226, "构件 ，": 5424, "， 构件": 7892, "构件 间": 5422, "的 联系": 6134, "联系 ，": 6666, "内 \n": 3300, "与 演化": 2730, "演化 的": 5736, "。 。": 2607, "ieee ,": 1889, "  2011": 760, "abstract  ": 1593, "  42010": 786, "42010 :": 1448, ": 2011": 1540, "  analysis": 817, "analysis  ": 1623, "  architectures": 823, "  systems": 984, "systems  ": 2247, "  use": 1002, "use  ": 2304, "\n of": 110, "  description": 858, "description  ": 1782, "  is": 895, "is  ": 1924, "  are": 824, "are \n": 1645, "is \n": 1923, "  key": 903, "key  ": 1943, "  32": 774, "32  ": 1407, "另 一个": 3659, "架构 是": 5443, "是 一系列": 5240, "booch ,": 1689, "  1999": 755, "  important": 887, "decisions  ": 1780, "about  ": 1591, "system ,": 2243, "the \n": 2256, "  their": 988, "their  ": 2259, "  which": 1009, "  with": 1011, "with  ": 2336, "\n in": 99, "  composition": 850, "these  ": 2261, "  into": 893, "into  ": 1917, "architectural  ": 1636, "  style": 981, "style  ": 2230, "  —": 1017, "—  ": 2374, "关于": 3254, "它们": 4230, "接口": 4887, "这些": 7264, "相互协作": 6234, "时所": 5205, "体现": 3078, "行为": 6747, "更": 5276, "子系统": 4202, "33": 1408, "2005": 1354, "所有": 4779, "有关": 5311, "改造": 5002, "设": 6896, "kruchten": 1946, "2006": 1355, "推理": 4907, "其他": 3285, "产生": 2934, "34": 1411, "用户": 5884, "各种": 3745, "包含": 3505, "抽象": 4830, "改变": 4999, "框架": 5497, "能够": 6678, "有效": 5314, "一起": 2665, "硬件": 6278, "集": 7567, "合": 3747, "预期": 7649, "还": 7257, "观点": 6799, "2018": 1358, "35": 1414, "components": 1739, "connectors": 1749, "某种": 5466, "功能": 3463, "模块": 5529, "存储": 4206, "简单": 6392, "pipe": 2071, "procedure": 2094, "广播": 4503, "event": 1826, "客户": 4326, "服务器": 5348, "client": 1726, "通信协议": 7366, "数据库": 5076, "拓扑": 4834, "逻辑": 7391, "36": 1417, "37": 1420, "规划": 6802, "复杂度": 4111, "可行性": 3729, "测试人员": 5677, "交流": 2920, "合理": 3754, "未来": 5360, "各": 3738, "按照": 4861, "规定": 6814, "保证": 3169, "得到": 4653, "一致": 2659, "维护": 6599, "升级": 3522, "作为": 3116, "： \n": 7941, "的 组织": 6123, "的 结构": 6125, "它们 之间": 4231, "的 接口": 6051, "接口 ，": 4891, "\n 及": 264, "的 行为": 6141, "✓ 如何": 2435, "， 使": 7822, "使 它们": 3126, "更 \n": 5277, "\n 大": 317, "大 的": 4162, "风格 。": 7673, "  33": 775, "33  ": 1410, "  2005": 758, "是 架构": 5250, "所有 \n": 4780, "， 这些": 7927, "架构 改造": 5442, "的 影响": 6037, "设 \n": 6897, "\n 计": 620, "需求 。": 7589, "kruchten ,": 1947, "  2006": 759, "\n +": 4, "定义 的": 4275, "  34": 776, "34  ": 1413, "认为 软件架构": 6883, "生命周期 中": 5867, "用户 的": 5896, "的 各种": 5997, "\n 关系": 225, "结构 。": 6565, "是 一个": 5238, "能够 \n": 6679, "\n 有效": 457, "在 一起": 3976, "和 硬件": 3868, "构件 的": 5418, "集 \n": 7568, "\n 合": 278, "， 从": 7816, "的 角度": 6146, "【 cmu": 2625, "cmu ,": 1728, "  2018": 761, "  35": 777, "35  ": 1416, "， 我们": 7874, "可 将": 3671, "理解 为": 5852, "  =": 807, "=  ": 1550, "  components": 849, "components  ": 1740, "connectors  ": 1750, "功能 的": 3472, "的 可": 5992, "可 重用": 3676, "模块 单元": 5539, "单元 ，": 3552, "表示 了": 6768, "了 系统": 2860, "系统 中": 6454, "的 计算": 6149, "计算 单元": 6866, "和 数据": 3849, "数据 存储": 5055, "连接件 ：": 7310, "组件 之间": 6518, "的 交互": 5950, "交互 ，": 2915, "简单 的": 6393, "的 连接件": 6169, "： 管道": 7974, "（ pipe": 7768, "pipe ）": 2076, "调用 \n": 7022, "（ event": 7767, "event  ": 1828, "服务器 \n": 5349, "， 数据库": 7885, "约束 ：": 6497, "组件 和": 6519, "和 连接件": 3885, "的 拓扑": 6049, "- 总结": 1189, "总结 \n": 4717, "  36": 778, "36  ": 1419, "\n 36": 44, "36 \n": 1418, "  37": 779, "37  ": 1422, "\n 37": 45, "37 \n": 1421, "项目 的": 7638, "、 复杂度": 2565, "sa ，": 2151, "支持 用户": 4986, "\n 之间": 178, "之间 进行": 2842, "的 sa": 5937, "\n 进行": 669, "合理 的": 3755, "\n 从": 191, "考虑 未来": 6650, "未来 的": 5361, "的 需求": 6182, "需求 变化": 7593, "变化 ，": 3643, "并 使": 4485, "软件 实现": 7110, "实现 \n": 4305, "\n 各": 276, "开发 团队": 4575, "规定 的": 6815, "得到 的": 4655, "\n 维护": 588, "维护 和": 6602, "经典": 6549, "模": 5527, "型": 4038, "逐步": 7351, "细化": 6542, "作": 3114, "根据": 5491, "软": 7099, "体": 3076, "系": 6444, "38": 1423, "39": 1426, "看": 6250, "复用": 4117, "粒度": 6435, "出来": 3353, "怎样": 4676, "才": 4785, "典型": 3296, "建筑风格": 4564, "需要": 7603, "绘制": 6581, "图纸": 3967, "快速": 4670, "即": 3558, "恰当": 4727, "修改": 3184, "更改": 5285, "受": 3632, "40": 1438, "构造": 5432, "单": 3536, "种": 6312, "域": 4040, "现": 5832, "如果": 4189, "进": 7267, "何种": 3113, "工": 4435, "分": 3364, "析": 5433, "41": 1441, "modeling": 1987, "styles": 2232, "evaluation": 1825, "product": 2104, "line": 1959, "dssa": 1795, "动态": 3494, "42": 1444, "自": 6691, "适应": 7325, "面临": 7624, "瓶颈": 5859, "全面": 3231, "易于": 5225, "有助于": 5312, "就是": 4395, "映射": 5231, "依据": 3147, "调整": 7017, "单一": 3538, "关联": 3269, "统的": 6591, "潜在": 5742, "特": 5781, "特点": 5796, "运行": 7241, "动态性": 3499, "引起": 4612, "风格 ，": 7695, "， 设计": 7916, "模 \n": 5528, "\n 型": 300, "型 ，": 4039, "存在 的": 4213, "并 进行": 4494, "， 并": 7868, "后 的": 3772, "\n 根据": 482, "件 的": 3011, "属性 进行": 4431, "进行 测试": 7291, "测试 。": 5668, "软件 生命周期": 7113, "生命周期 \n": 5865, "\n 软": 651, "软 \n": 7100, "件 \n": 3009, "\n 体": 206, "体 \n": 3077, "\n 系": 573, "系 \n": 6445, "\n 结": 582, "构 \n": 5409, "\n 作": 210, "用 \n": 5876, "  38": 780, "38  ": 1425, "\n 38": 46, "38 \n": 1424, "  39": 781, "39  ": 1428, "\n 39": 47, "39 \n": 1427, "活动 -": 5643, "- 从": 1172, "都 有": 7435, "、 可": 2558, "可 复用": 3670, "复用 的": 4120, "建 \n": 4554, "典型 的": 3298, "的 建筑风格": 6034, ") \n": 1126, "结构 是": 6567, "是 什么": 5242, "的 构件": 6075, "\n 如何": 318, "如何 对": 4184, "对 其": 4340, "其 进行": 3282, "的 修改": 5968, "模块 \n": 5530, "如何 保证": 4183, "不 受": 2692, "进行 质量": 7295, "  40": 783, "40  ": 1440, "\n 40": 49, "40 \n": 1439, "的 问题": 6178, "什么 ？": 2951, "单 \n": 3537, "\n 元": 220, "\n 种": 556, "\n 典型": 231, "\n 域": 301, "系 结构": 6446, "如何 进行": 4188, "件 体系结构": 3010, "\n 现": 521, "\n 如果": 319, "\n 存在": 323, "进 \n": 7268, "\n 使用": 211, "工 \n": 4436, "对 软件": 4349, "分 \n": 3365, "\n 析": 474, "  41": 784, "41  ": 1443, "\n 41": 50, "41 \n": 1442, "➢ 软件体系结构": 2530, "  modeling": 915, "风格 的": 7689, "( software": 1113, "  styles": 982, "styles )": 2234, "  evaluation": 872, "➢ 软件产品": 2529, "特定 领域": 5790, "框架 的": 5499, "product  ": 2105, "  line": 908, "line  ": 1960, "动态 软件体系结构": 3498, "  42": 785, "42  ": 1446, "\n 动态": 252, "动态 演化": 3496, "演化 自": 5738, "自 适应": 6693, "适应 体系结构": 7326, "\n 42": 51, "42 \n": 1445, "适应 系统": 7329, "系统 提供": 6464, "提供 了": 4934, "系统 、": 6452, "理解 的": 5854, "的 模型": 6083, "模型 \n": 5552, "系统 动态": 6458, "基于 体系结构": 4045, "的 自": 6136, "演化 ，": 5741, "变化 。": 3639, "表示 ，": 6769, "框架 \n": 5498, "\n 调整": 639, "了 变化": 2858, "关联 关系": 3271, "\n 统的": 586, "影响 。": 4638, "特 \n": 5782, "软件 运行": 7118, "运行 环境": 7248, "变化 的": 3641, "提出 了": 4940, "整个": 5102, "因此": 3930, "发": 3599, "条件": 5393, "监控": 6194, "全局": 3226, "43": 1449, "引入": 4605, "不断": 2714, "提取": 4947, "最新": 5296, "自身": 6709, "层面": 4411, "管理器": 6408, "执行": 4789, "状态": 5801, "管": 6399, "器": 3918, "层": 4404, "或": 4756, "扩展": 4800, "效用": 5027, "44": 1452, "rainbow": 2124, "由": 5910, "外部": 4127, "控制": 4895, "来": 5395, "对系统": 4353, "规则": 6805, "api": 1632, "重构": 7464, "基础设施": 4063, "多种": 4152, "稳定性": 6336, "明显": 5218, "引擎": 4610, "操作": 4968, "响应": 3901, "时间": 5207, "对比": 4352, "图": 3944, "45": 1455, "首先": 7706, "规约": 6817, "然后": 5770, "分析方法": 3390, "当": 4620, "添加": 5707, "删除": 3422, "适应性": 7331, "应用程序": 4533, "部署": 7417, "动作": 3493, "具体": 3290, "创建": 3417, "释放": 7456, "容器": 4330, "实例": 4290, "替换": 5289, "并且": 4496, "相应": 6248, "协议": 3534, "接收": 4893, "者": 6651, "传输": 3059, "46": 1458, "目前": 6205, "电子": 5916, "务": 3489, "结合": 6560, "思路": 4685, "新兴": 5130, "融合": 6743, "广泛应用": 4509, "要求 。": 6792, "组件 间": 6523, "， 其": 7829, "其 被": 3281, "共享 ，": 3243, "， 因此": 7849, "\n 发": 266, "适应 演化": 7328, "对 整个": 4345, "， 实现": 7859, "- 动态": 1178, "  43": 787, "43  ": 1451, "\n 43": 52, "43 \n": 1450, "， 负责": 7920, "负责 从": 7034, "运行 的": 7249, "的 系统": 6120, "最新 的": 5297, "的 软件体系结构": 6159, "信息 ，": 3177, "把 系统": 4820, "自身 的": 6710, "的 动态": 5981, "动态 调整": 3497, "的 抽象": 6048, "层面 上": 4412, "在 实际": 3983, "在 软件体系结构": 4002, "实现 软件": 4317, "演化 。": 5731, "\n 运行": 665, "运行 \n": 7242, "系统 \n": 6448, "管理器 \n": 6409, "管 \n": 6400, "\n 规划": 613, "器 \n": 3919, "\n 数据库": 432, "\n 用户": 531, "用户 管理": 5897, "管理 \n": 6402, "变化 \n": 3638, "\n 自": 602, "层 \n": 4405, "扩展 \n": 4801, "知识库 \n": 6265, "\n 领域": 715, "\n 效用": 427, "  44": 788, "44  ": 1454, "\n 44": 53, "44 \n": 1453, "年 提出": 4478, "， 使用": 7824, "使用 了": 3134, "模型 的": 5555, "\n 控制": 408, "来 实现": 5397, "适应 调整": 7330, "调整 。": 7019, "。 该": 2615, "系统 ，": 6484, "， 对系统": 7862, "分析 ，": 3388, "应用 于": 4526, "明显 。": 5219, "引擎 \n": 4611, "\n 约束": 575, "执行 \n": 4790, "\n 模型": 490, "\n 策略": 566, "性能 \n": 4702, "\n 操作": 419, "操作 \n": 4969, "\n 规则": 614, "规则 \n": 6806, "映射 \n": 5232, "重构 \n": 7465, "中 \n": 2763, "响应 \n": 3902, "图 （": 3948, "  45": 789, "45  ": 1457, "\n 45": 54, "45 \n": 1456, "需求 规约": 7599, "规约 \n": 6818, "体系结构 ，": 3109, "相关 的": 6241, "场景 ，": 4028, "， 然后": 7899, "\n 当": 372, "的 调整": 6153, "调整 ，": 7020, "基于 场景": 4046, "场景 的": 4024, "方案 的": 5157, "的 确定": 6111, "确定 \n": 6297, "\n 部署": 682, "部署 \n": 7418, "调整 \n": 7018, "\n 具体": 228, "构件 \n": 5412, "\n 添加": 508, "删除 \n": 3423, "\n 创建": 239, "实例 \n": 4291, "替换 \n": 5290, "， 并且": 7869, "新 的": 5129, "的 实例": 6023, "的 约束": 6121, "添加 、": 5708, "、 删除": 2557, "相应 的": 6249, "或 删除": 4758, "和 接收": 3845, "\n 者": 596, "者 \n": 6652, "的 实现": 6025, "\n 配置": 684, "配置 \n": 7441, "层次 的": 4408, "  46": 790, "46  ": 1460, "\n 未来": 462, "\n 46": 55, "46 \n": 1459, "\n 务": 250, "物理": 5778, "⚫": 2421, "应对": 4521, "强化": 4615, "概率": 5521, "智能": 5269, "成熟": 4751, "推动": 4906, "47": 1461, "reference": 2131, "[": 1559, "j": 1934, "]": 1565, "engineering": 1821, "52": 1485, "knowledge": 1944, "g": 1864, "i": 1881, "p": 2051, "et": 1823, "al": 1607, "up": 2301, "quality": 2119, "58": 1501, "http": 1878, "www": 2349, "edu": 1809, "start": 2207, "48": 1464, "\n 物理": 516, "\n ⚫": 157, "技术 ，": 4817, "\n 技术": 395, "发展 ，": 3605, "\n 应": 357, "  47": 791, "47  ": 1463, "\n 47": 56, "47 \n": 1462, "➢ 【": 2447, "  [": 808, "] .": 1568, "  engineering": 871, "engineering  ": 1822, "( 4": 1093, "4 )": 1432, ") :": 1131, "software \n": 2192, "  knowledge": 904, "knowledge  ": 1945, "  j": 899, "architecture .": 1640, "et  ": 1824, "  al": 810, "  quality": 947, "quality  ": 2120, ": /": 1539, "/ /": 1250, "/ www": 1267, "www .": 2350, ". edu": 1227, "  48": 792, "48  ": 1466, "\n 48": 57, "48 \n": 1465, "借用": 3192, "project": 2108, "more": 1996, "!": 1072, "49": 1467, "课后": 7006, "作业": 3115, "①": 2413, "推送": 4909, "②": 2414, "开放": 4587, "后续": 3776, "阅读": 7517, "资料": 7057, "你": 3124, "欢迎": 5565, "各位": 3743, "微信": 4661, "邮箱": 7408, "baoliang": 1674, "@": 1557, "mail": 1973, "xidian": 2352, "cn": 1729, "  more": 919, "”  ": 2395, "  (": 734, "  49": 793, "49  ": 1469, "\n 课后": 636, "课后 思考": 7007, "思考 与": 4683, "与 作业": 2723, "\n ①": 153, "\n ②": 154, "资料 ，": 7058, "” 。": 2396, "\n 49": 58, "49 \n": 1468, "  50": 795, "50  ": 1481, "\n 50": 61, "50 \n": 1480, "\n 欢迎": 492, "欢迎 各位": 5566, "各位 同学": 3744, "同学 交流": 3762, "交流 讨论": 2922, "讨论 \n": 6885, "\n 学院": 325, "学院 微信": 4225, "微信 \n": 4662, "\n 邮箱": 680, "邮箱 ：": 7409, "： baoliang": 7943, "baoliang @": 1675, "@ mail": 1558, "mail .": 1974, ". xidian": 1233, "xidian .": 2353, "edu .": 1810, ". cn": 1225, "定位": 4279, "软件测试": 7157, "运维": 7239, "退役": 7319, "界定": 5923, "降低": 7539, "复杂性": 4113, "提高": 4953, "全面性": 3233, "软件维护": 7167, "成本": 4747, "回收": 3925, "质": 7041, "量": 7475, "基": 4041, "石": 6269, "串": 2785, "联": 6663, "生": 5861, "命": 3803, "周": 3796, "期": 5351, "阶": 7526, "段": 5597, "心": 4663, "精准": 6438, "捕获": 4865, "结构设计": 6575, "严格": 2753, "灵活": 5750, "确保": 6283, "否": 3786, "可行": 3727, "有效性": 5319, "过": 7202, "程": 6326, "包": 3503, "含": 3788, "关": 3252, "键": 7490, "步": 5583, "骤": 7718, "关键环节": 3275, "统": 6587, "网络": 6633, "数据处理": 5071, "代理": 2977, "微": 4659, "原生": 3575, "到": 3436, "这个": 7263, "周期": 3799, "涵盖": 5705, "多个": 4138, "目的": 6218, "帮助": 4461, "地": 4010, "控制软件": 4905, "良好": 6714, "以下": 2999, "增强": 4071, "可读性": 3731, "可维护性": 3712, "高效": 7732, "减少": 3343, "长期": 7495, "迁移": 7199, "资源": 7059, "测试阶段": 5680, "确": 6281, "定": 4264, "术": 5369, "促": 3154, "利": 3425, "块": 4035, "接": 4882, "口": 3656, "影": 4634, "响": 3899, "能": 6671, "资": 7053, "源": 5716, "支": 4977, "持": 4839, "错": 7484, "误": 6995, "处": 4076, "理": 5847, "异": 4590, "常": 4463, "供": 3143, "保": 3161, "安": 4233, "义": 2828, "测": 5663, "试": 6972, "例": 3140, "障": 7563, "位": 3069, "功": 3461, "\n 第": 561, "1 部分": 1284, "部分  ": 7415, "  体系结构": 1022, "定位 与": 4280, "构建 \n": 5428, "第 2": 6354, "2 部分": 1347, "风格 大": 7683, "内容 -": 3308, "- 什么": 1171, "是 体系结构": 5243, "\n 生命周期": 526, "系统 设计": 6477, "\n 软件测试": 656, "软件测试 \n": 7158, "软件 部署": 7120, "\n 运维": 664, "运维 迭代": 7240, "迭代 \n": 7316, "系统 退役": 6481, "退役 \n": 7320, "体系结构 引导": 3095, "引导  ": 4609, "  软件": 1062, "软件 功能": 7106, "功能 界定": 3471, "界定 \n": 5924, "体系结构 降低": 3107, "降低  ": 7540, "  系统": 1054, "的 复杂性": 6012, "复杂性 \n": 4114, "体系结构 提高": 3099, "提高  ": 4954, "软件 代码": 7104, "代码 质量": 2985, "质量 \n": 7044, "体系结构 提升": 3098, "提升  ": 4944, "  测试": 1045, "的 全面性": 5970, "全面性 \n": 3234, "  部署": 1066, "部署 的": 7423, "的 灵活性": 6093, "  软件维护": 1064, "软件维护 成本": 7168, "成本 \n": 4748, "体系结构 指导": 3096, "指导  ": 4852, "系统 有效": 6470, "有效 回收": 5315, "回收 \n": 3926, "\n 不": 165, "不 \n": 2691, "\n 单": 259, "\n 是": 449, "\n 提": 413, "\n 高": 722, "\n 质": 643, "质 \n": 7042, "\n 量": 687, "量 \n": 7476, "\n 基": 302, "基 \n": 4042, "\n 石": 548, "石 \n": 6270, "\n 更": 454, "\n 串": 171, "串 \n": 2786, "\n 联": 597, "联 \n": 6664, "\n 全": 222, "全 \n": 3224, "\n 生": 525, "生 \n": 5862, "\n 命": 286, "命 \n": 3804, "\n 周": 285, "周 \n": 3797, "\n 期": 461, "期 \n": 5352, "\n 中": 170, "各 \n": 3739, "\n 个": 169, "个 \n": 2756, "\n 阶": 698, "阶 \n": 7527, "\n 段": 495, "段 \n": 5598, "核 \n": 5486, "\n 心": 378, "心 \n": 4664, "\n 精准": 572, "精准 捕获": 6439, "捕获 \n": 4866, "\n 恰当": 387, "恰当 的": 4728, "的 体系": 5962, "\n 结构设计": 584, "结构设计 \n": 6576, "\n 严格": 168, "严格 的": 2754, "结构 评估": 6571, "\n 灵活": 514, "灵活 的": 5752, "结构 演化": 6569, "\n 影响": 375, "影响 后续": 4639, "后续 架构设计": 3778, "\n 确保": 552, "确保 对": 6285, "质量  ": 7045, "  属性": 1035, "的 支持": 6056, "支持 \n": 4981, "\n 验证": 719, "验证 架构": 7712, "是  ": 5236, "  否": 1029, "否 安全": 3787, "安全 可行": 4237, "可行 \n": 3728, "确保 有效性": 6287, "有效性  ": 5320, "  与": 1020, "与 适应性": 2735, "适应性 \n": 7332, "\n 过": 661, "过 \n": 7203, "\n 程": 559, "程 \n": 6327, "\n 包": 253, "包 \n": 3504, "\n 含": 283, "含 \n": 3789, "\n 关": 224, "关 \n": 3253, "\n 键": 691, "键 \n": 7491, "\n 步": 494, "步 \n": 5584, "\n 骤": 721, "骤 \n": 7719, "体系结构 构建": 3101, "\n 多种": 315, "多种 风格": 4153, "风格 设计": 7691, "设计 ：": 6926, "： 构建": 7967, "的 关键环节": 5974, "关键环节 \n": 3276, "数据流 \n": 5080, "返回 \n": 7253, "\n 独立": 519, "独立 构件": 5814, "虚拟机 \n": 6740, "介绍 系": 2957, "\n 统": 585, "统 设计": 6589, "\n 体系": 207, "构 构建": 5410, "结构 \n": 6563, "\n 风格": 717, "\n 开放": 366, "开放 网络": 4588, "网络 \n": 6634, "大 数据处理": 4160, "数据处理 \n": 5072, "基于 多": 4047, "多 代理": 4134, "代理 \n": 2978, "服务 \n": 5328, "\n 微": 377, "微 服务": 4660, "云 原生": 2895, "原生 \n": 3576, "\n …": 151, "\n 经典": 581, "经典 软件体系结构": 6551, "\n 新兴": 441, "新兴 软件体系结构": 5131, "体系结构 -": 3086, "- 生命周期": 1202, "生命周期 (": 5866, "( 1": 1088, "1 /": 1279, "/ 2": 1255, "2 )": 1341, "  （": 1069, "到 软件": 3440, "使用 的": 3136, "过程 。": 7222, "、 开发": 2569, "开发 、": 4573, "、 使用": 2554, "使用 、": 3132, "、 维护": 2587, "阶段 。": 7534, "的 主要": 5948, "主要 目的": 2820, "目的 是": 6219, "是 帮助": 5245, "帮助 \n": 4462, "项目 团队": 7635, "有效 地": 5316, "管理 和": 6405, "过程 ，": 7231, "， 确保": 7904, "确保 软件产品": 6291, "\n 实现": 337, "测试 \n": 5666, "和 迭代": 3886, "生命周期 内": 5868, "内 的": 3304, "( 2": 1091, "2 /": 1343, "良好 的": 6715, "软件体系结构 在": 7132, "在 设计": 3998, "实现 阶段": 4318, "阶段 ，": 7538, "， 降低": 7936, "降低 系统": 7545, "系统 复杂性": 6461, "复杂性 ，": 4116, "， 增强": 7852, "代码 可读性": 2982, "和 可维护性": 3826, "基础 。": 4060, "能够 适应": 6684, "快速 变化": 4671, "需求 和": 7595, "和 技术": 3843, "技术 环境": 4815, "环境 ，": 5831, "， 减少": 7833, "维护 成本": 6603, "软件 退役": 7119, "退役 阶段": 7322, "， 指导": 7878, "迁移 和": 7201, "和 资源": 3880, "的 有效": 6071, "执行 。": 4791, "\n 阶段": 699, "阶段 \n": 7529, "\n 测试阶段": 506, "测试阶段 \n": 5681, "部署 阶段": 7425, "\n 确": 551, "确 \n": 6282, "\n 定": 331, "定 \n": 4265, "统 \n": 6588, "本 \n": 5363, "\n 术": 465, "可 \n": 3668, "行 \n": 6745, "\n 性": 382, "性 \n": 4688, "\n 促": 214, "促 \n": 3155, "\n 进": 667, "\n 利": 241, "利 \n": 3426, "\n 相": 543, "间 \n": 7512, "通 \n": 7356, "\n 组": 577, "\n 块": 299, "接 \n": 4883, "\n 口": 270, "\n 影": 374, "影 \n": 4635, "\n 响": 288, "响 \n": 3900, "\n 能": 599, "能 \n": 6672, "\n 资": 646, "资 \n": 7054, "\n 源": 510, "源 \n": 5717, "\n 支": 420, "支 \n": 4978, "\n 持": 400, "持 \n": 4840, "\n 错": 689, "错 \n": 7485, "\n 误": 635, "\n 处": 308, "处 \n": 4077, "\n 理": 522, "理 \n": 5848, "\n 异": 367, "异 \n": 4591, "\n 常": 349, "常 \n": 4464, "\n 供": 213, "\n 实": 334, "现 \n": 5833, "\n 图": 293, "图 \n": 3945, "\n 保": 216, "保 \n": 3162, "\n 安": 327, "安 \n": 4234, "\n 义": 177, "\n 测": 503, "测 \n": 5664, "\n 试": 631, "试 \n": 6973, "\n 例": 212, "\n 障": 704, "位 \n": 3070, "功 \n": 3462, "部": 7410, "署": 6640, "配": 7438, "置": 6639, "环": 5824, "境": 4064, "规": 6800, "服": 5325, "转": 7088, "移": 6318, "遵": 7399, "标": 5473, "准": 3337, "维": 6597, "护": 4823, "分析阶段": 3394, "完整性": 4262, "一致性": 2661, "符合": 6349, "早期": 5187, "清晰": 5710, "外": 4121, "集中": 7569, "挑战": 4863, "限制": 7546, "促进": 3156, "利益": 3430, "相关者": 6242, "沟通": 5624, "一种": 2651, "视角": 6832, "设计阶段": 6931, "关键": 3272, "转化": 7090, "解决方案": 6842, "交互方式": 2917, "外部环境": 4130, "直接": 6221, "可扩展性": 3700, "支持系统": 4988, "异常": 4594, "合适": 3756, "栈": 5481, "措施": 4912, "成员": 4746, "增长": 4074, "蓝图": 6736, "预定": 7646, "选型": 7341, "细节": 6544, "编程语言": 6616, "开": 4569, "协调": 3535, "保证系统": 3171, "整性": 5110, "划分": 3410, "冗余": 3317, "维护性": 6604, "团": 3935, "队": 7520, "效率": 5024, "资源管理": 7069, "流动": 5655, "资源分配": 7068, "并发": 4498, "确保安全": 6294, "恢复": 4720, "单元测试": 3555, "\n 部": 681, "部 \n": 7411, "\n 署": 593, "\n 配": 683, "配 \n": 7439, "\n 置": 592, "环 \n": 5825, "\n 境": 305, "合 \n": 3748, "\n 规": 612, "规 \n": 6801, "\n 服": 458, "服 \n": 5326, "务 \n": 3490, "转 \n": 7089, "\n 移": 557, "移 \n": 6319, "\n 代": 193, "长 \n": 7493, "遵 \n": 7400, "\n 标": 480, "标 \n": 5474, "\n 准": 233, "准 \n": 3338, "\n 数": 429, "据 \n": 4869, "维 \n": 6598, "\n 护": 396, "规划 和": 6804, "和 需求": 3892, "需求 分析阶段": 7592, "- 定位": 1184, "与 作用": 2724, "作用 (": 3121, "/ 7": 1260, "7 )": 1516, "进行 功能": 7285, "功能 和": 3469, "和 性能": 3839, "确保 需求": 6293, "需求 的": 7597, "的 完整性": 6019, "完整性 和": 4263, "和 一致性": 3810, "一致性 。": 2662, "的 长期": 6177, "能力 。": 6676, "➢ 将": 2484, "为 系统": 2800, "实现 提供": 4311, "提供 清晰": 4936, "清晰 的": 5712, "方向 。": 5148, ". 确定": 1241, "决定 软件": 3329, "组件 \n": 6516, "确定 组件": 6301, "外 \n": 4122, "交互 \n": 2907, "收集 和": 4995, "主要 目标": 2819, "上 \n": 2672, "评估 技术": 6951, "技术 \n": 4809, "\n 特定": 517, "特定 需求": 5789, "的 挑战": 6050, "\n 限制": 701, "限制 \n": 7547, "确定 软件": 6304, "\n 帮助": 348, "明确 \n": 5221, "的 重": 6174, "重 \n": 7459, ". 促进": 1234, "沟通 \n": 5625, "\n 提供": 414, "提供 一种": 4933, "\n 化": 255, "全面 的": 3232, "视角 ，": 6833, "促进 \n": 3157, "交流 \n": 2921, "系统 设计阶段": 6478, "设计阶段 \n": 6932, "软件体系结构 设计": 7141, "设计 是": 6920, "是 系统": 5254, "的 关键": 5973, "活动 ，": 5645, "， 提供": 7880, "转化 为": 7091, "为 具体": 2794, "解决方案 。": 6844, "➢ 定义": 2478, "定义 系统": 4276, "， 包括": 7838, "主要 组件": 2821, "组件 、": 6517, "的 关系": 5972, "直接 影响": 6225, "影响 软件": 4644, "属性 。": 4419, "影响 性能": 4641, "性能 、": 4703, "、 可扩展性": 2559, "可扩展性 和": 3702, "和 安全性": 3832, "安全性 ，": 4247, "清晰 方向": 5711, "\n 指导": 403, "和 模块": 3855, "\n 接口": 407, "安全 \n": 4236, "性能 和": 4707, "资源 \n": 7060, "利用 \n": 3428, "\n 促进": 215, "维护 \n": 6600, "\n 支持": 422, "错误 \n": 7487, "\n 异常": 368, "处理 \n": 4081, "\n 组件": 578, "及 \n": 3586, "关系 \n": 3265, "接口 \n": 4888, "确保 \n": 6284, "\n 交互": 184, "\n 方式": 442, "规划 \n": 6803, "\n 安全": 328, "\n 措施": 411, "措施 \n": 4913, "\n 直接": 542, "直接 \n": 6222, "于 \n": 2893, "\n 团队": 292, "协作 \n": 3530, "\n 架构": 476, "\n 模式": 491, "增长 \n": 4075, "考虑 \n": 6647, "\n 处理": 309, "\n 错误": 690, "异常 \n": 4595, "构建 的": 5429, "的 蓝图": 6139, "蓝图 ，": 6737, "指导 开发": 4853, "将 设计": 4382, "代码 ，": 2987, "预定 的": 7648, "➢ 良好": 2518, "是 确保": 5253, "一致性 和": 2663, "➢ 影响": 2486, "选型 和": 7342, "和 实施": 3833, "细节 ，": 6545, "选择 ，": 7350, "以及 实现": 3002, "模式 。": 5559, "开 \n": 4570, "过程 的": 7228, "和 协调": 3822, "的 一致性": 5944, "\n 整性": 436, "模块 划分": 5538, "划分 \n": 3411, "  实现": 1034, "冗余 \n": 3318, "  提高": 1040, "提高 系统": 4957, "\n 维护性": 589, "团 \n": 3936, "\n 队": 695, "开发 效率": 4576, "效率 \n": 5025, ". 影响": 1235, "性能 优化": 4704, "优化 \n": 3038, "资源管理 \n": 7070, "  决定": 1024, "数据 流动": 5057, "\n 资源分配": 648, "系统 性能": 6463, ". 确保安全": 1240, "确保安全 和": 6295, "和 可": 3823, "机制 ，": 5376, "错误 ，": 7488, "实现 系统": 4315, "和 恢复": 3840, "恢复 策略": 4725, "( 3": 1092, "3 /": 1392, "定义 测试": 4272, "范围 和": 6725, "方法 ，": 5167, "， 确定": 7905, "需要 进行": 7610, "进行 单元测试": 7286, "、 集成": 2598, "或 系统": 4762, "简化": 6391, "覆盖率": 6796, "从而": 2969, "测试用例": 5678, "覆盖": 6795, "故障": 5013, "了解": 2863, "依赖": 3148, "员": 3793, "模块化": 5548, "可靠": 3732, "显著": 5264, "特别": 5783, "例如": 3141, "持续": 4842, "流程": 5659, "排除": 4877, "所": 4776, "需": 7580, "软硬件": 7170, "无缝": 5179, "伸缩性": 3066, "弹性": 4613, "负载": 7037, "发生": 3619, "数据安全": 5074, "债务": 3201, "隔离": 7561, "容易": 4331, "定位问题": 4281, "修复": 3182, "复": 4103, "杂度": 5382, "稳定": 6334, "容错": 4333, "数据管理": 5091, "平滑": 4475, "转移": 7097, "业务": 2743, "中断": 2781, "格式": 5496, "再": 3315, "遵循": 7402, "法规": 5631, "和行": 3897, "业": 2742, "法律": 5629, "测试 工作": 5671, "工作 ，": 4443, "， 提高": 7882, "测试 效率": 5673, "效率 和": 5026, "➢ 为": 2452, "确保 测试": 6288, "高效 、": 7733, "有效 的": 5318, "， 从而": 7817, "保证 软件": 3170, "质量 。": 7046, "\n 范围": 604, "对 \n": 4338, "系统 功能": 6457, "的 部分": 6172, "部分 \n": 7414, "\n 测试用例": 505, "测试用例 \n": 5679, "\n 重要": 686, "重要 的": 7473, "的 功能": 5980, "功能 \n": 3464, "场景 \n": 4015, "故障 \n": 5014, "\n 定位": 333, "的 依赖": 5966, "依赖 关系": 3150, "模式 ，": 5561, "人 \n": 2940, "\n 员": 284, "\n 问题": 693, ". 支持": 1237, "\n 清晰": 509, "划分 和": 3413, "\n 模块化": 489, "模块化 设计": 5550, "可靠 的": 3733, "自 \n": 6692, "体系结构 中": 3088, "， 应": 7870, "得到 \n": 4654, "特别 关注": 5784, "关注 \n": 3257, "4 /": 1435, "10 \n": 1290, "软件体系结构 决定": 7130, "策略 和": 6387, "和 过程": 3883, "， 例如": 7825, "服务 架构": 5336, "架构 可能": 5439, "和 持续": 3844, "部署 。": 7419, "的 稳定性": 6114, "稳定性 和": 6337, "可维护性 。": 3714, "监控 、": 6196, "和 故障": 3848, "， 根据": 7894, "操作 。": 4971, "部署 配置": 7424, "和 环境": 3863, "环境 \n": 5827, "  影响": 1036, "影响 系统": 4643, "配置 和": 7443, "所 \n": 4777, "\n 需": 706, "需 的": 7582, "的 环境": 6099, "部署 （": 7426, "策略 ，": 6388, "发布 策略": 3614, ". 支持系统": 1238, "支持系统 的": 4989, "\n 伸缩性": 205, "  考虑": 1055, "根据 负载": 5493, "变化 自动": 3642, "\n 或": 389, "  在": 1031, "在 故障": 3987, "发生 时": 3622, "时 \n": 5191, "\n 快速": 379, "恢复 \n": 4721, "数据安全 \n": 5075, "( 5": 1094, "5 /": 1475, "适应 变化": 7327, "能力 ，": 6677, "新 功能": 5128, "、 性能": 2570, "技术 债务": 4810, "处理 。": 4083, "工作 的": 4442, "复杂性 和": 4115, "成本 ，": 4750, "使 系统": 3127, "更 高效": 5279, "高效 。": 7734, "持续 发展": 4843, "确保 系统": 6290, "系统 能够": 6476, "灵活 应对": 5751, "应对 不断": 4522, "不断 变化": 2715, "环境 。": 5828, "促进 系统": 3159, "的 可维护性": 5994, "和 组件": 3872, "隔离 ，": 7562, "\n 降低": 700, "复杂度 \n": 4112, "更 容易": 5278, "容易 地": 4332, "块 的": 4036, "化 ，": 3514, "添加 新": 5709, "现有 功能": 5843, "和 复": 3830, "复 \n": 4104, "\n 杂度": 467, ". 确保": 1239, "性 和": 4694, "设计 原则": 6914, "地 应对": 4011, "负载 和": 7038, "\n 故障": 426, "考虑 到": 6648, "的 性能": 6039, "\n 容错": 339, "( 6": 1095, "6 /": 1508, "退役 过程": 7321, "促进 数据": 3158, "数据 和": 5053, "资源 的": 7064, "的 安全": 6017, "定义 清晰": 4273, "和 存储": 3831, "策略 。": 6385, "支持 平滑": 4984, "平滑 的": 4476, "的 服务": 6072, "服务 转移": 5342, "业务 中断": 2745, "中断 的": 2782, "的 风险": 6187, "迁移 \n": 7200, "  使用": 1023, "\n 过程": 662, "环境 中": 5830, "时 ，": 5199, "减少 \n": 3344, "\n 业务": 167, "风险 \n": 7697, "和行 \n": 3898, "， 所有": 7876, "法律 和": 5630, "和 规定": 3875, "( 7": 1096, "7 /": 1518, "传达": 3062, "且": 2741, "系统化": 6485, "步骤": 5585, "是从": 5256, "通常": 7368, "attribute": 1667, "qaw": 2118, "表现": 6764, "参与者": 3582, "列表": 3415, "共同": 3246, "每": 5599, "场": 4013, "优先": 3028, "级": 6502, "详细": 6987, "记录": 6890, "别的": 3434, "属": 4414, "动": 3491, "如下": 4177, "精心设计": 6440, "过程 -": 7221, "风格 选择": 7693, "属性 设计": 4429, "准备 阶段": 3341, "➢ 识别": 2525, "➢ 场景": 2472, "➢ 优先级": 2457, "➢ 需求": 2542, "➢ 评估": 2524, "识别 潜在": 6965, "潜在 的": 5743, "➢ 分析": 2462, "➢ 考虑": 2517, "做出 决策": 3205, "决策 和": 3334, "分析 与": 3384, "识别 \n": 6962, "➢ 确定": 2511, "的 优先级": 5959, "优先级 \n": 3031, "➢ 设计": 2523, "满足 属性": 5726, "➢ 权衡": 2501, "➢ 文档": 2495, "➢ 目标": 2510, "目标 和": 6212, "范围 确定": 6726, "相关 文档": 6239, "➢ 组建": 2516, "评估 方法": 6952, "➢ 进行": 2536, "进行 体系结构": 7281, "➢ 质量": 2527, "➢ 风险": 2544, "提出 改进": 4941, "建议 \n": 4567, "编写 评估": 6612, "报告 \n": 4825, "变更 的": 3649, "的 因素": 6003, "➢ 实施": 2479, "过程 是": 7227, "系统化 的": 6486, "的 步骤": 6086, "步骤 ，": 5591, "体系结构 评估": 3106, "评估 ，": 6957, "体系结构 演化": 3103, "软件体系结构 分析": 7131, "15 \n": 1312, "- 阶段": 1213, "阶段 任务": 7535, "任务 (": 3018, "/ 5": 1258, "5 )": 1473, "非 功能": 7615, "功能 需求": 3474, "➢ 通常": 2538, "通常 采用": 7372, "  attribute": 831, "attribute  ": 1668, "方式 来": 5152, "来 进行": 5401, "属性 捕获": 4423, "影响 软件系统": 4645, "的 非": 6183, "表现 ，": 6766, "， 是": 7889, "成功 和": 4743, "可 持续": 3673, "重要 步骤": 7472, "步骤 。": 5588, "\n 明确": 447, "\n 工作": 346, "\n 参与者": 263, "和 识别": 3877, "软件 系": 7115, "量 属性": 7477, "每 \n": 5600, "识别 出": 6963, "出 的": 3349, "具体 的": 3291, "优先 \n": 3029, "\n 级": 576, "\n 详细": 633, "识 \n": 6960, "质量 属": 7048, "属 \n": 4415, "性 、": 4689, "\n 动": 251, "的 详细": 6152, "设计 (": 6905, ") -": 1129, "- 风格": 1215, "可维护性 、": 3713, "、 扩展性": 2573, "扩展性 。": 4803, "➢ 精心设计": 2513, "精心设计 的": 6441, "软件体系结构 能够": 7140, "能够 显著": 6681, "显著 提升": 5265, "提升 软件": 4946, "的 整体": 6063, "整体 质量": 5109, "质量 ，": 7050, "确保 软件系统": 6292, "长期 成功": 7496, "发展 。": 3603, "1 、": 1281, "、 需求": 2599, "2 、": 1344, "3 、": 1393, "、 识别": 2591, "的 扩展性": 6046, "6 个": 1509, "个 步骤": 2759, "步骤 ：": 5592, "- 质量": 1210, "\n 解决": 617, "\n 优化": 200, "\n 传达": 204, "在于": 4008, "旨在": 5185, "是否": 5257, "成功率": 4745, "分析法": 3392, "trade": 2281, "off": 2023, "method": 1984, "atam": 1661, "saam": 2152, "推移": 4908, "适应环境": 7333, "价值": 3012, "多年": 4148, "积累": 6316, "通用": 7373, "往往": 4647, "标志": 5480, "哥特式": 3908, "文艺复兴": 5122, "带来": 4459, "重大": 7462, "垂直": 4037, "思想": 4678, "分类": 3396, "诸如": 7002, "材料": 5392, "特征": 5791, "加以": 3483, "区分": 3520, "着": 6254, "➢ 针对": 2540, "设计 的": 6922, "的 核心": 6080, "软件系统 能够": 7166, "能够 满足": 6683, "关键 的": 3274, "功能性 需求": 3480, "流程 \n": 5660, "与 评估": 2734, "属性 要求": 4428, "评估 的": 6954, "风险 、": 7698, "问题 和": 7505, "瓶颈 ，": 5860, "以及 它们": 3001, "质量 和": 7047, "产生 的": 2938, "➢ 有效": 2499, "显著 提高": 5266, "的 成功率": 6041, "稳定 运行": 6335, "运行 。": 7243, "的 方法": 6067, "分析法 （": 3393, "  trade": 995, "trade -": 2282, "- off": 1161, "off  ": 2024, "  method": 914, "method ，": 1986, "， atam": 7806, "\n 方法": 443, "\n 报告": 397, "软件体系结构 演化": 7138, "随着 时间": 7556, "时间 的": 5215, "的 推移": 6053, "进行 的": 7293, "变化 和": 3640, "和 调整": 3879, "的 变化": 5990, "价值 。": 3013, "， 软件体系结构": 7921, "主要 包含": 2815, "个 主要": 2757, "主要 步骤": 2818, "\n 当前": 373, "变更 \n": 3648, "的 发展": 5986, "发展 与": 3604, "是 风格": 5255, "风格 -": 7671, "从 “": 2964, "研究 和": 6275, "➢ 一个": 2448, "的 、": 5939, "通用 的": 7375, "➢ 从": 2455, "文艺复兴 式": 5123, "和 实践": 3835, "作用 。": 3122, "建筑风格 \n": 4565, "建筑 思想": 4563, "思想 \n": 4679, "的 一种": 5942, "的 模式": 6084, "、 技术": 2574, "上 的": 2673, "的 特征": 6095, "了 一种": 2855, "的 解决方案": 6147, "解决方案 \n": 6843, "选择 和": 7347, "着 系统": 6255, "、 可维护性": 2561, "和 重用": 3890, "重用 性": 7469, "性 等": 4698, "- 定义": 1183, "反映": 3594, "共有": 3250, "语义": 6988, "特性": 5793, "各个": 3740, "完整": 4260, "一类": 2654, "多次": 4151, "若干": 6721, "{": 2355, "topology": 2279, "}": 2362, "经过": 6553, "已有": 4454, "除此之外": 7553, "还有": 7259, "目录": 6206, "批处理": 4805, "过滤器": 7206, "直观": 6226, "flow": 1846, "或者": 4766, "到达": 3444, "激活": 5746, "某个": 5462, "单元格": 3553, "值": 3202, "则": 3416, "依赖于": 3151, "会": 3047, "下": 2679, "系统对": 6487, "知道": 6267, "生产者": 5863, "消费者": 5702, "身份": 7083, "输入": 7179, "输出": 7191, "端口": 6344, "写": 3320, "<": 